;; Basic translation table to input KANA with ASCII keyboard
;; Created by DEMIZU Norotishi <nori-d@is.aist-nara.ac.jp>  on 1994.1.26
;; !Id: kanainput.el,v 1.2 1994/02/04 13:19:38 nori-d Exp nori-d !

;;
;; 配布条件は GNU GENERAL PUBLIC LICENSE に従います。
;;
;; これは ASCII 配列のキーボードでかな入力で仮名漢字変換をするための
;; 変換ルールを記した lisp です。使い方は次の通りです。
;;  (load "its/kanainput")
;;  (setq its:*standard-modes*
;;        (append (list (its:get-mode-map "kanainput")
;;                       its:*standard-modes*)))
;;  (setq-default its:*current-map* (its:get-mode-map "kanainput"))
;;

;;
;; 一般の JIS かなと違うところは次です。
;;   ・ 「ろ」が "|" の位置に。本来の「ろ」の位置にキーがないため。(不便)
;;   ・ 「ー」が多くのアスキーキーボードでは期待と違う位置にある。(不便)
;;   ・ `「'  が `[' の位置に。ASCII の "[" に気持ちを合わせた。
;;   ・ `」'  が `]' の位置に。ASCII の "]" に気持ちを合わせた。
;;   ・ 「？」が "?" の位置に。ASCII の "?" に気持ちを合わせた。
;;   ・ 「・」が ":" の位置に。「？」を "?" と同じ位置にするためずらした。
;;
;; 全角文字、半角文字、JIS 記号入力の部分は its/hira.el と同じにしました。
;; 入力のための prefix は以下の通り。
;;   Q: 全角入力 (Quote と覚える)  ; k-zenkaku-escape で定義可能
;;   A: 半角入力 (Ascii と覚える)  ; k-hankaku-escape で定義可能
;;   S: 記号入力 (Symbol と覚える) ; k-symbols-escape で定義可能
;;
;;「かな入力時の配列」
;; ぬ！ ふ＠ あぁ うぅ えぇ おぉ やゃ ゆゅ よょ わを ほろ へ＋ ー〜
;;  た__ て__ いぃ すす かヵ んん なな にに らら せせ ”「 ゜」
;;   ち__ と__ しし はは きき くく まま のの りり れ・ けヶ むろ
;;    つっ ささ そそ ひひ ここ みみ もも ね、 る。 め？
;;
;;「記号入力時の配列」(proposed by TANAKA Jiro <jiro@math.keio.ac.jp> 90.3.2)
;; ○● ▽▼ △▲ □■ ◇◆ ☆★ ◎£ ¢× ♂【 ♀】 〜∴ ≠± ´¨
;;  《〈 》〉 ____ 々仝 〆§ ￥__ ____ ____ ____ 〒↑ 『〔 』〕
;;   ____ヽヾ ゝゞ 〃→ ‐― ←__ ↓＿ ↑￣ →__ ゛゜ ‘“ ＼‖
;;    ____ :-:-)〇℃ ※÷ °← ′↓ ″〓 ‥≦ …≧ ・∞
;;
;;「想定している ASCII キーボードの配列」(半角、全角入力時も)
;; 1!  2@  3#  4$  5%  6^  7&  8*  9(  0)  -_  =+  `~
;;  qQ  wW  eE  rR  tT  yY  uU  iI  oO  pP  [{  ]}
;;   aA  sS  dD  fF  gG  hH  jJ  kK  lL  ;:  '"  \|
;;    zZ  xX  cC  vV  bB  nN  mM  ,<  .>  /?
;;
;; kanainput.el 1.1 -> 1.2:
;;  o 記号入力 prefix を "X" から "S" にした。
;;  o 以下の入力方法を簡単にするため変更した。
;;      「ゐ」  "W4E" --> "WE"
;;      「ゑ」  "W4%" --> "W%"
;;      「ヴ」  "W4[" --> "W["
;;  o 以下の入力結果を変更した。本物の Quote にするため。
;;      "Q\\"   「￥」-->「＼」
;;      "Q~"    「￣」-->「〜」
;;  o 以下のルールを追加した。
;;      "Sy" -->「￥」
;;      "SJ" -->「＿」
;;      "Sk" -->「￣」
;;  o 各ルールについて its-defrule を書いていたのを、
;;    簡単のため表ベースにした。
;;

(its-define-mode "kanainput" "か" t)
(defvar k-zenkaku-escape "Q")  ; 全角入力の prefix
(defvar k-hankaku-escape "A")  ; 半角入力の prefix
(defvar k-symbols-escape "S")  ; 記号入力の prefix


(defun its:make-terminal-state-kanainput (map input action state)
  (cond((its:standard-actionp action) (action-output action))
       (t nil)))

(let ((its:make-terminal-state 'its:make-terminal-state-kanainput))
  ;; かな入力用
  (dolist (normal-pair
	   '(
	     ;; 清音
	     ("3"   "あ") ("e"   "い") ("4"   "う") ("5"   "え") ("6"   "お")
	     ("t"   "か") ("g"   "き") ("h"   "く") ("'"   "け") ("b"   "こ")
	     ("x"   "さ") ("d"   "し") ("r"   "す") ("p"   "せ") ("c"   "そ")
	     ("q"   "た") ("a"   "ち") ("z"   "つ") ("w"   "て") ("s"   "と")
	     ("u"   "な") ("i"   "に") ("1"   "ぬ") (","   "ね") ("k"   "の")
	     ("f"   "は") ("v"   "ひ") ("2"   "ふ") ("="   "へ") ("-"   "ほ")
	     ("j"   "ま") ("n"   "み") ("\\"  "む") ("/"   "め") ("m"   "も")
	     ("7"   "や")              ("8"   "ゆ")              ("9"   "よ")
	     ("o"   "ら") ("l"   "り") ("."   "る") (";"   "れ") ("|"   "ろ")
	     ("0"   "わ") ("WE"  "ゐ")              ("W%"  "ゑ") (")"   "を")
	     ("y"   "ん")
	     ;; 濁音
	     ("t["  "が") ("g["  "ぎ") ("h["  "ぐ") ("'["  "げ") ("b["  "ご")
	     ("x["  "ざ") ("d["  "じ") ("r["  "ず") ("p["  "ぜ") ("c["  "ぞ")
	     ("q["  "だ") ("a["  "ぢ") ("z["  "づ") ("w["  "で") ("s["  "ど")
	     ("f["  "ば") ("v["  "び") ("2["  "ぶ") ("=["  "べ") ("-["  "ぼ")
	     ;; 半濁音
	     ("f]"  "ぱ") ("v]"  "ぴ") ("2]"  "ぷ") ("=]"  "ぺ") ("-]"  "ぽ")
	     ;; 小さな字
	     ("#"   "ぁ") ("E"   "ぃ") ("$"   "ぅ") ("%"   "ぇ") ("^"   "ぉ")
	     ("&"   "ゃ")              ("*"   "ゅ")              ("("   "ょ")
	     ("T"   "ヵ") ("\""  "ヶ") ("Z"   "っ") ("W0"  "ゎ") ("W#"  "ゎ")
	     ;; その他
	     ("W["  "ヴ") ("W"   "う")
	     ;; 記号
	     ("<"   "、") (">"   "。") (":"   "・") ("?"   "？")
	     ("{"   "「") ("}"   "」") ("["   "゛") ("]"   "゜") ("`"   "ー")
	     ;; シフトキー押下時の扱い
	     ("G"   "き") ("H"   "く") ("B"   "こ")
	     ("X"   "さ") ("D"   "し") ("R"   "す") ("P"   "せ") ("C"   "そ")
	     ("U"   "な") ("I"   "に") ("K"   "の")
	     ("F"   "は") ("V"   "ひ")
	     ("J"   "ま") ("N"   "み") ("M"   "も")
	     ("O"   "ら") ("L"   "り")
	     ("Y"   "ん")
	     ("!"   "！") ("@"   "＠") ("+"   "＋") ("~"   "〜")
	     ("_"   "ろ");;; 「ろ」があるキーボード用
	     ))
    (its-defrule (car normal-pair) (car (cdr normal-pair))))

  ;; 全角入力
  (dolist (zenkaku-pair
	   '(
	     (" "  "　") ("!"  "！") ("\"" "”") ("#"  "＃")  ; 20--24
	     ("$"  "＄") ("%"  "％") ("&"  "＆") ("'"  "’")  ; 25--27
	     ("("  "（") (")"  "）") ("*"  "＊") ("+"  "＋")  ; 28--2b
	     (","  "，") ("-"  "−") ("."  "．") ("/"  "／")  ; 2c--2f
	     ("0"  "０") ("1"  "１") ("2"  "２") ("3"  "３")  ; 30--33
	     ("4"  "４") ("5"  "５") ("6"  "６") ("7"  "７")  ; 34--37
	     ("8"  "８") ("9"  "９") (":"  "：") (";"  "；")  ; 38--3b
	     ("<"  "＜") ("="  "＝") (">"  "＞") ("?"  "？")  ; 3c--3f
	     ("@"  "＠") ("A"  "Ａ") ("B"  "Ｂ") ("C"  "Ｃ")  ; 40--43
	     ("D"  "Ｄ") ("E"  "Ｅ") ("F"  "Ｆ") ("G"  "Ｇ")  ; 44--47
	     ("H"  "Ｈ") ("I"  "Ｉ") ("J"  "Ｊ") ("K"  "Ｋ")  ; 48--4b
	     ("L"  "Ｌ") ("M"  "Ｍ") ("N"  "Ｎ") ("O"  "Ｏ")  ; 4c--4f
	     ("P"  "Ｐ") ("Q"  "Ｑ") ("R"  "Ｒ") ("S"  "Ｓ")  ; 50--53
	     ("T"  "Ｔ") ("U"  "Ｕ") ("V"  "Ｖ") ("W"  "Ｗ")  ; 54--57
	     ("X"  "Ｘ") ("Y"  "Ｙ") ("Z"  "Ｚ") ("["  "［")  ; 58--5a
	     ("\\" "＼") ("]"  "］") ("^"  "＾") ("_"  "＿")  ; 5b--5f
	     ("`"  "｀") ("a"  "ａ") ("b"  "ｂ") ("c"  "ｃ")  ; 60--63
	     ("d"  "ｄ") ("e"  "ｅ") ("f"  "ｆ") ("g"  "ｇ")  ; 64--67
	     ("h"  "ｈ") ("i"  "ｉ") ("j"  "ｊ") ("k"  "ｋ")  ; 68--6b
	     ("l"  "ｌ") ("m"  "ｍ") ("n"  "ｎ") ("o"  "ｏ")  ; 6c--6f
	     ("p"  "ｐ") ("q"  "ｑ") ("r"  "ｒ") ("s"  "ｓ")  ; 70--73
	     ("t"  "ｔ") ("u"  "ｕ") ("v"  "ｖ") ("w"  "ｗ")  ; 74--77
	     ("x"  "ｘ") ("y"  "ｙ") ("z"  "ｚ") ("{"  "｛")  ; 78--7b
	     ("|"  "｜") ("}"  "｝") ("~"  "〜")              ; 7c--7e
	     ))
    (its-defrule (concat k-zenkaku-escape (car zenkaku-pair))
		 (car (cdr zenkaku-pair))))

  ;; 半角入力
  (dolist (character
	   '( "1"  "2"  "3"  "4" "5"  "6"  "7"  "8"  "9"  "0"
	      " "  "!"  "@"  "#"  "$"  "%"  "^"  "&"  "*"  "("  ")"
	      "-"  "="  "`"  "\\" "|"  "_"  "+"  "~" "["  "]"  "{"  "}"
	      ":"  ";"  "\"" "'"  "<"  ">"  "?"  "/"  ","  "."
	      "a" "b" "c" "d" "e" "f" "g" "h" "i" "j" "k" "l" "m" "n"
	      "o" "p" "q" "r" "s" "t" "u" "v" "w" "x" "y" "z"
	      "A" "B" "C" "D" "E" "F" "G" "H" "I" "J" "K" "L" "M" "N"
	      "O" "P" "Q" "R" "S" "T" "U" "V" "W" "X" "Y" "Z"))
    (its-defrule (concat k-hankaku-escape character)  character))

  ;;; proposal key bindings for JIS symbols
  ;;; 90.3.2  by jiro@math.keio.ac.jp (TANAKA Jiro)
  ;;; 「￥」、「￣」、「＿」 are added
  ;;; 94.2.4 by nori-d@is.aist-nara.ac.jp (DEMIZU Noritoshi)
  (dolist (symbols-pair
	   '(
	     ("1"  "○") ("2"  "▽") ("3"  "△") ("4"  "□") ("5"  "◇")
	     ("6"  "☆") ("7"  "◎") ("8"  "¢") ("9"  "♂") ("0"  "♀")
	     ("-"  "〜") ("="  "≠") ("\\" "＼") ("`"  "´")
	     ("!"  "●") ("@"  "▼") ("#"  "▲") ("$"  "■") ("%"  "◆")
	     ("^"  "★") ("&"  "£") ("*"  "×") ("("  "【") (")"  "】")
	     ("_"  "∴") ("+"  "±") ("|"  "‖") ("~"  "¨")
	     ("q"  "《") ("w"  "》") ("r"  "々") ("t"  "〆") ("y"  "￥")
	     ("Q"  "〈") ("W"  "〉") ("R"  "仝") ("T"  "§")
	     ("p"  "〒") ("["  "『") ("]"  "』")
	     ("P"  "↑") ("{"  "〔") ("}"  "〕")
	     ("s"  "ヽ") ("d"  "ゝ") ("f"  "〃") ("g"  "‐")
	     ("S"  "ヾ") ("D"  "ゞ") ("F"  "→") ("G"  "―")
	     ("h"  "←") ("j"  "↓") ("k"  "↑") ("l"  "→")
	                 ("J"  "＿") ("K"  "￣")
	     (";"  "゛") (":"  "゜") ("\'" "‘") ("\"" "“")
	     ("x"  ":-") ("c"  "〇") ("v"  "※") ("b"  "°") ("n"  "′")
	     ("X" ":-)") ("C"  "℃") ("V"  "÷") ("B"  "←") ("N"  "↓")
	     ("m"  "″") (","  "‥") ("."  "…") ("/"  "・")
	     ("M"  "〓") ("<"  "≦") (">"  "≧") ("?"  "∞")
	     ))
    (its-defrule (concat k-symbols-escape (car symbols-pair))
		 (car (cdr symbols-pair))))
)
